#+TITLE: 2048 LLDB Debugging: Laboratory Notebook
#+AUTHOR: Claude & jwalsh
#+DATE: [2025-06-23]--[2025-06-25]
#+PROPERTY: header-args :mkdirp yes

** METHOD
#+begin_src python :tangle experiments/exp_004_decode.py :results output
def decode_grid(values, method="column-major"):
    print(f"=== {method.upper()} ===")
    for row in range(4):
        row_str = "|"
        for col in range(4):
            if method == "column-major":
                idx = col * 4 + row
            else:  # row-major
                idx = row * 4 + col
            val = values[idx]
            tile = (2 ** val) if val > 0 else 0
            row_str += f"{str(tile):>5} |"
        print(row_str)

# Test with actual memory dump
values = [3,1,3,1, 0,3,4,3, 0,1,0,6, 0,0,0,2]
decode_grid(values, "column-major")
print()
decode_grid(values, "row-major")
#+end_src

#+RESULTS:
: === COLUMN-MAJOR ===
: |    8 |    0 |    0 |    0 |
: |    2 |    8 |    2 |    0 |
: |    8 |   16 |    0 |    0 |
: |    2 |    8 |   64 |    4 |
: 
: === ROW-MAJOR ===
: |    8 |    2 |    8 |    2 |
: |    0 |    8 |   16 |    8 |
: |    0 |    2 |    0 |   64 |
: |    0 |    0 |    0 |    4 |

